// Тест_УтилитыСанитайзера

Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты
		.ДобавитьТестовыйНабор("Массивы")
			.ДобавитьТестовыйНабор("Развернуть")
				.ДобавитьТест("Развернуть_ВозвращаетМассивВОбратномПорядке")
				.ДобавитьТест("Развернуть_НеИзменяетИсходныйМассив")
				.ДобавитьТест("Развернуть_ПереданНеМассив");
	
КонецПроцедуры

Процедура Развернуть_НеИзменяетИсходныйМассив() Экспорт
	
	ИсходныйМассив = Новый Массив;
	ИсходныйМассив.Добавить(1);
	ИсходныйМассив.Добавить(2);
	ИсходныйМассив.Добавить(3);
	
	ОжидаемыйМассив = Новый Массив;
	ОжидаемыйМассив.Добавить(1);
	ОжидаемыйМассив.Добавить(2);
	ОжидаемыйМассив.Добавить(3);
	
	Массивы.Развернуть(ИсходныйМассив);
	
	ЮТест.ОжидаетЧто(ИсходныйМассив)
		.Равно(ОжидаемыйМассив);
	
КонецПроцедуры

Процедура Развернуть_ВозвращаетМассивВОбратномПорядке() Экспорт
	
	// Подготовка
	ИсходныйМассив = Новый Массив;
	ИсходныйМассив.Добавить(1);
	ИсходныйМассив.Добавить(2);
	ИсходныйМассив.Добавить(3);
	
	ОжидаемыйМассив = Новый Массив;
	ОжидаемыйМассив.Добавить(3);
	ОжидаемыйМассив.Добавить(2);
	ОжидаемыйМассив.Добавить(1);
	
	// Действие
	Результат = Массивы.Развернуть(ИсходныйМассив);
	
	// Проверка
	ЮТест.ОжидаетЧто(Результат)
		.Равно(ОжидаемыйМассив);
	
КонецПроцедуры

Процедура Развернуть_ПереданНеМассив() Экспорт
	
	// Подготовка
	ИсходноеЗначение = "Это не массив";
	
	// Действие и проверка
	ЮТест.ОжидаетЧто(Массивы)
	.Метод("Развернуть")
	.Параметр(ИсходноеЗначение)
	.ВыбрасываетИсключение("Ожидался массив");
	
КонецПроцедуры