#Область Преобразования

//insert() — вставка текста в строку
//remove() / erase() — удаление части строки
//compare() — сравнение строк
//capitalize() — первая буква в верхний регистр
//Фильтр() - оставляет в строке только допустимые символы
//ОбратныйФильтр()


#КонецОбласти




//sdfsadf3223вапА23АВ
//фильтр = "23";
//"322323"


//шаблон = "[Число] не равно [Число2]";
//а = Новый Структура("Число2", 1, 4);
//ф(шаблон, а); // 1 не равно 4



//Функция СоответствуетОбщимТребованиямКИменам(Строка) Экспорт
//	
//	Если ТипЗнч(Строка) <> Тип("Строка") Тогда
//		
//		ТекстОшибки = НСтр("ru = 'Передан параметр недопустимого типа'");
//		ВызватьИсключение ТекстОшибки;
//		
//	КонецЕсли;
//	
//	ДопустимыеСимволы = АнглийскиеБуквы() + РусскиеБукы() + Цифры() + "_";
//	
//	Результат = СостоитИз(Строка, ДопустимыеСимволы)
//		И Не Содержит(Цифры(), Подстрока(Строка, 1, 1));
//	
//	Возврат Результат;
//	
//КонецФункции 

//Функция Длина(Строка) Экспорт
//	Возврат СтрДлина(Строка);
//КонецФункции

//Функция АнглийскиеБуквы()
//	Возврат "abcdefghijklmnopqrstuvwxyz";
//КонецФункции

//Функция РусскиеБукы()
//	Возврат "абвгдеёжзийклмнопрстуфхцчшщьыъэюя";
//КонецФункции

//Функция Цифры()
//	Возврат "0123456789";
//КонецФункции

//Функция Содержит(Строка, Подстрока) Экспорт
//	Возврат СтрЧислоВхождений(Строка, Подстрока) > 0;
//КонецФункции

//Функция СостоитИз(Строка, СтрокаСимволов) Экспорт
//	
//	СимволыПроверяемойСтроки = ИспользуемыеСимволы(Строка);
//	
//	Для Каждого Символ Из СимволыПроверяемойСтроки Цикл
//		Если Не Содержит(СтрокаСимволов, НРег(Символ)) Тогда
//			Возврат Ложь;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат Истина;
//	
//КонецФункции

//Функция ИспользуемыеСимволы(Строка) Экспорт
//	
//	ИспользуемыеСимволы = Новый Соответствие;
//	
//	Для Позиция = 1 По Длина(Строка) Цикл
//		ИспользуемыеСимволы.Вставить(Подстрока(Строка, Позиция, 1));
//	КонецЦикла;
//	
//	Возврат Коллекции.Ключи(ИспользуемыеСимволы);
//	
//КонецФункции

//Функция Подстрока(Строка, Позиция, ДлинаПодстроки) Экспорт
//	Возврат Сред(Строка, Позиция, ДлинаПодстроки);
//КонецФункции